%%%-------------------------------------------------------------------
%%% @author wangcw
%%% @copyright (C) 2024, REDGREAT
%% @doc
%%
%% eadm public API
%%
%% @end
%%% Created : 2024-01-23 17:27:13
%%%-------------------------------------------------------------------
-module(eadm_app).
-author("wangcw").

%%%===================================================================
%%% 行为
%%%===================================================================
-behaviour(application).

%%%===================================================================
%%% 函数导出
%%%===================================================================
-export([start/2, stop/1]).

%%====================================================================
%% API 函数
%%====================================================================

%%--------------------------------------------------------------------
%% @private
%% @doc
%% 应用程序启动函数，当使用application:start/[1,2]启动应用时调用
%% 负责启动应用程序的进程。如果应用程序按照OTP设计原则构建为监督树，
%% 则意味着启动树的顶级监督者。
%%
%% @end
%%--------------------------------------------------------------------
start(_StartType, _StartArgs) ->
    application:start(lager),
    eadm_mnesia:init(),
    {ok, Pid} = eadm_sup:start_link(),
    timer:apply_after(2000, fun() -> lager:info("EADM 启动成功，访问地址：http://127.0.0.1:8080") end),
    timer:apply_after(3000, eadm_crontab_controller, init, []),
    {ok, Pid}.

%%--------------------------------------------------------------------
%% @private
%% @doc
%% 应用程序停止函数，当应用程序停止时调用
%% 作为Module:start/2的反向操作，用于执行必要的清理工作
%% 返回值将被忽略
%%
%% @end
%%--------------------------------------------------------------------
stop(_State) ->
    application:stop(lager),
    ok.
