%%%-------------------------------------------------------------------
%%% @author wangcw
%%% @copyright (C) 2024, REDGREAT
%%% @doc
%%%
%%% JT/T-808协议处理
%%%
%%% @end
%%% Created : 2024-08-16 上午11:31
%%%-------------------------------------------------------------------
-module(jt808_parser).
-author("wangcw").

-include("jt808.hrl").
%%%===================================================================
%%% 函数导出
%%%===================================================================
-export([parse/1]).

%%====================================================================
%% API 函数
%%====================================================================
%% @doc
%% 主函数
%% @end
parse(Data) ->
    <<Header:8/integer, Length:16/integer, Command:16/integer, Checksum:8/integer, DataBytes/binary>> = Data,
    if
        Header =/= '0x78' -> {error, bad_header};
        (Length + 5) /= byte_size(Data) -> {error, length_mismatch};
        true -> {ok, #{header => Header, length => Length, command => Command, data => DataBytes, checksum => Checksum}}
    end.

%%====================================================================
%% 内部函数
%%====================================================================
